tap "charmbracelet/tap"
tap "minio/stable"
tap "sst/tap"
tap "yakitrak/yakitrak"
brew "chafa"
brew "fastfetch"
brew "fzf"
brew "ffmpeg"
brew "fonttools"
brew "gh"
brew "glances"
brew "glow"
brew "hugo"
brew "jq"
brew "mas"
brew "mosh"
brew "node"
brew "pandoc"
brew "php"
brew "starship"
brew "tmux"
brew "uv"
brew "wp-cli"
brew "xcodegen"
brew "yara"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/crush"
brew "minio/stable/mc"
brew "sst/tap/opencode"
brew "yakitrak/yakitrak/obsidian-cli"
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "audio-hijack"
cask "chatgpt"
cask "choosy"
cask "claude"
cask "codex"
cask "crossover"
cask "cursor"
cask "dot"
cask "dropbox"
cask "epic-games"
cask "espanso"
cask "farrago"
cask "firefox"
cask "firefox@developer-edition"
cask "fission"
cask "font-domine"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-noto-sans"
cask "ghostty"
cask "handbrake-app"
cask "hazel"
cask "helium-browser"
cask "imageoptim"
cask "keyboardcleantool"
cask "loopback"
cask "macwhisper"
cask "makemkv"
cask "mdrp"
cask "muzzle"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "plex"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "rustdesk"
cask "screens-connect"
cask "secretive"
cask "setapp"
cask "soundsource"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "superduper"
cask "symboliclinker"
cask "taphouse"
cask "telegram"
cask "thaw"
cask "todoist-app"
cask "visual-studio-code"
cask "vlc"
cask "wispr-flow"
cask "wordpresscom-studio"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "Actions For Obsidian", id: 1659667937
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "ControllerForHomeKit", id: 1198176727
mas "Drafts", id: 1435957248
mas "Endel", id: 1346247457
mas "Fin", id: 726213320
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "HomeCam", id: 1292995895
mas "HomePass", id: 1330266650
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Mapper", id: 1589391989
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "MusicMatch", id: 1596146219
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Parachute", id: 6748614170
mas "Parcel 2", id: 375589283
mas "Photomator", id: 1444636541
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Screens 5", id: 1663047912
mas "ShellFish", id: 1336634154
mas "StopTheMadness Pro", id: 6471380298
mas "Tampermonkey", id: 6738342400
mas "Tampermonkey Classic", id: 1482490089
mas "TextSniper", id: 1528890965
mas "uBlock Origin Lite", id: 6745342698
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
mas "xSearch", id: 1579902068
vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kilocode.kilo-code"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "tailscale.vscode-tailscale"
vscode "tryghost.ghost"
uv "claude-code-transcripts"