tap "charmbracelet/tap"
tap "minio/stable"
tap "sst/tap"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# General-purpose scripting language
brew "php"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for WordPress
brew "wp-cli"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# AI-powered knowledge management system with MCP server integration
brew "basicmachines-co/basic-memory/basic-memory"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Application launcher and productivity software
cask "alfred"
# Records audio from any application
cask "audio-hijack"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Universal chat app powered by Matrix
cask "beeper"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Open links in any browser
cask "choosy"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to run Windows software
cask "crossover"
# Write, edit, and chat about your code with AI
cask "cursor"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Audio editor
cask "fission"
# Fonts
cask "font-domine"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-noto-sans"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Automated organisation
cask "hazel"
# Chromium-based web browser
cask "helium-browser"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Cable-free audio router
cask "loopback"
# Speech recognition tool
cask "macwhisper"
# Video format converter (transcoder)
cask "makemkv"
# Utility to rip and copy DVD content
cask "mdrp"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Secure enclave SSH agent
cask "secretive"
# Collection of apps available by subscription
cask "setapp"
# Sound and audio controller
cask "soundsource"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Backup, recovery and cloning software
cask "superduper"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Service that allows users to make symbolic links in the Finder
cask "symboliclinker"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# WordPress local development environment
cask "wordpresscom-studio"
# MAS Apps
mas "1Password for Safari", id: 1569813296
mas "Actions For Obsidian", id: 1659667937
mas "Amphetamine", id: 937984704
mas "Clocker", id: 1056643111
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "ControllerForHomeKit", id: 1198176727
mas "Drafts", id: 1435957248
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Endel", id: 1346247457
mas "Fantastical", id: 975937182
mas "Fin", id: 726213320
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "HomeCam", id: 1292995895
mas "HomePass", id: 1330266650
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Mapper", id: 1589391989
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Mona", id: 1659154653
mas "Motion", id: 434290957
mas "MusicMatch", id: 1596146219
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Orb", id: 6477840170
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Perplexity", id: 6714467650
mas "Photomator", id: 1444636541
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Prompt", id: 1594420480
mas "Reeder", id: 1529448980
mas "Screens 5", id: 1663047912
mas "ShellFish", id: 1336634154
mas "StopTheMadness Pro", id: 6471380298
mas "Synctrain", id: 0
mas "Tampermonkey", id: 6738342400
mas "Tampermonkey Classic", id: 1482490089
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Vinegar", id: 1591303229
mas "xSearch", id: 1579902068
vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kilocode.kilo-code"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "tailscale.vscode-tailscale"
vscode "tryghost.ghost"
